<a href="https://colab.research.google.com/github/YahiaML/W3scools-R-course/blob/main/L_17_Data_Frames_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Forming a Data Frame

In [3]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)

df

  Name  Age
1 Yahia 21
2 Abdo  20
3 Ammar 19
4 Saeed 20
5 Waeel 20

#Summarize the Data

In [5]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)

summary(df)

     Name                Age
 Length:5           Min.   :19
 Class :character   1st Qu.:20
 Mode  :character   Median :20
                    Mean   :20
                    3rd Qu.:20
                    Max.   :21

#Access Items

In [13]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)

df[1]          # Access the first column
df["Name"]     # Access the column by its name
df$Name        # Access the column by its name

  Name
1 Yahia
2 Abdo
3 Ammar
4 Saeed
5 Waeel

  Name
1 Yahia
2 Abdo
3 Ammar
4 Saeed
5 Waeel

[1] "Yahia" "Abdo"  "Ammar" "Saeed" "Waeel"

# Add Rows

In [28]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)

df <- rbind(df, c("Mohannad", 20))
df

# Add an empty row
df[nrow(df)+1,] <- NA
df

  Name     Age
1 Yahia    21
2 Abdo     20
3 Ammar    19
4 Saeed    20
5 Waeel    20
6 Mohannad 20

  Name     Age
1 Yahia    21
2 Abdo     20
3 Ammar    19
4 Saeed    20
5 Waeel    20
6 Mohannad 20
7 NA       NA

# Add columns

In [17]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)

df$College <- c("science", "computer sci.", "Engineering", "computer sci.", "Engineering")

df

  Name  Age College
1 Yahia 21  science
2 Abdo  20  computer sci.
3 Ammar 19  Engineering
4 Saeed 20  computer sci.
5 Waeel 20  Engineering

#Remove rows and columns

In [25]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20),
  College = c("science", "computer sci.", "Engineering", "computer sci.", "Engineering")
)

df_removed_column <- df[-c(3)]        # Remove columns
df_removed_column

df_removed_row <- df[-c(1),]          # Remove rows
df_removed_row

  Name  Age
1 Yahia 21
2 Abdo  20
3 Ammar 19
4 Saeed 20
5 Waeel 20

  Name  Age College
2 Abdo  20  computer sci.
3 Ammar 19  Engineering
4 Saeed 20  computer sci.
5 Waeel 20  Engineering

In [40]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20),
  College = c("science", "computer sci.", "Engineering", "computer sci.", "Engineering")
)

df_removed_column <- subset(df, select = -c(College) )       # Remove a column by name
df_removed_column

  Name  Age
1 Yahia 21
2 Abdo  20
3 Ammar 19
4 Saeed 20
5 Waeel 20

# Remove empty rows

In [41]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)

# Add an empty row
df[nrow(df)+1,] <- NA
df

# Remove the empty row
df <- na.omit(df)
df

  Name  Age
1 Yahia 21
2 Abdo  20
3 Ammar 19
4 Saeed 20
5 Waeel 20
6 NA    NA

  Name  Age
1 Yahia 21
2 Abdo  20
3 Ammar 19
4 Saeed 20
5 Waeel 20

# Change column name

In [18]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20),
  College = c("science", "computer sci.", "Engineering", "computer sci.", "Engineering")
)

names(df)[3] <- "Studying"
df

  Name  Age Studying
1 Yahia 21  science
2 Abdo  20  computer sci.
3 Ammar 19  Engineering
4 Saeed 20  computer sci.
5 Waeel 20  Engineering

#Number of Rows and Columns

In [15]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)


dim(df)
nrow(df)
ncol(df)

[1] 5 2

[1] 5

[1] 2

#Data frame Length

In [42]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20),
  College = c("science", "computer sci.", "Engineering", "computer sci.", "Engineering")
)

length(df)

[1] 3